{
  "backend/main.mo": "Motoko canister implementing user profiles, access control, 1:1 conversations, and message storage with helper functions for conversation lookup and authorization checks.",
  "feature_evidence.json": "Feature evidence manifest mapping implemented features to source files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including auth flow, messenger UI, hooks, and styling.",
  "frontend/index.css": "Tailwind base and theme variables defining a warm color palette for light and dark modes with global styling rules.",
  "frontend/index.html": "Root HTML document that loads the React app via main.tsx into the #root element.",
  "frontend/src/App.tsx": "Top-level React component handling authentication state, profile setup, and routing into the messenger UI.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting first‑time users to enter a display name and save their profile with validation and success/error toasts.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing screen for unauthenticated users offering Internet Identity sign‑in with branding and loading states.",
  "frontend/src/components/auth/UserIdentityBadge.tsx": "User menu showing profile name and principal with an option to sign out and clear cached queries.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing global header branding and containing the main application content area.",
  "frontend/src/components/messenger/ConversationHeader.tsx": "Header for an active conversation displaying its ID and offering a manual refresh action.",
  "frontend/src/components/messenger/ConversationList.tsx": "Displays the conversation sidebar, handling loading, empty states, and selection, and renders individual conversation items.",
  "frontend/src/components/messenger/EmptyStates.tsx": "Provides simple UI components for when no conversation is selected or when a conversation has no messages.",
  "frontend/src/components/messenger/MessageComposer.tsx": "Handles composing and sending messages with enter-to-send behavior and loading state.",
  "frontend/src/components/messenger/MessagePane.tsx": "Shows the active conversation with header, messages, loading/empty states, and message composer.",
  "frontend/src/components/messenger/MessageThread.tsx": "Renders a list of messages with styling for own vs. others’ messages and timestamps.",
  "frontend/src/components/messenger/MessengerShell.tsx": "Top-level layout managing selected conversation and combining the sidebar and message pane.",
  "frontend/src/components/messenger/NewChatForm.tsx": "Form for creating a new conversation using a principal ID, with expand/collapse behavior and creation handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching and saving the caller’s user profile and loading arbitrary user profiles.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for conversations, messages, creating conversations, and sending messages.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive CSS variables for light and dark themes, applying base styling to body and borders.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider, and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters and sessionStorage keys, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors sourced from CSS variables, custom animations, typography, container queries, and theme extensions.",
  "project_state.json": "Describes the overall project state and feature list for Shaheen Messenger, outlining implemented requirements and versioning."
}